> `vmid = "${count.index + 200}"` seems to be working for me.

I did attempt to use the string interpolation method but had identical results; failure.

I'm going to go ahead and paste some stuff here.

<details><summary>providers.tf</summary>
<p>

```go
terraform {
  required_providers {
    # https://registry.terraform.io/providers/Telmate/proxmox/latest/docs
    proxmox = {
      source = "Telmate/proxmox"
      version = "2.9.14"
    }
  }
}

provider "proxmox" {
  # Configuration options
  pm_debug = true
  pm_log_enable = true
  pm_log_file   = "terraform-plugin-proxmox.log"
  pm_log_levels = {
    _default    = "debug"
    _capturelog = ""
  }
  # Allowed simultaneous Proxmox processes (defaults: 4)
  # Setting pm_parallel = 1 to cope with Provider errors (and resource contention) - workaround "Cycle" errors and API timeouts
  pm_parallel = 1

  # Timeout value (seconds) for Proxmox API calls (default: 300)
  pm_timeout = 600
}
```
</p>
</details> 

<details><summary>main.tf</summary>
<p>

```go
# https://registry.terraform.io/providers/Telmate/proxmox/latest/docs/resources/vm_qemu
resource "proxmox_vm_qemu" "control-plane" {
    # control-plane nodes are known in k3s as a server; worker nodes are agent
    count   = 3
    vmid    = "${count.index + 100}"
    name    = "control-${count.index}"
    tags    = "control"

    target_node = var.proxmox_node

    clone = var.template_name

    agent    = 1
    os_type  = "cloud-init"
    cores    = 2
    sockets  = 1
    cpu      = "host"
    memory   = 2048
    scsihw   = "virtio-scsi-pci"
    bootdisk = "scsi0"

    disk {
        slot     = 0
        size     = "10G"
        type     = "scsi"
        storage  = "local-lvm"
        iothread = 1
    }

    network {
        model  = "virtio"
        bridge = "vmbr0"
    }

    lifecycle {
        ignore_changes = [
            network,
        ]
    }

    ipconfig0 = "ip=dhcp"

    nameserver = "${var.proxmox_dns}"

    sshkeys = file("${var.ssh_public_key_path}")

    connection {
        type        = "ssh"
        user        = "ubuntu"
        private_key = file("${var.ssh_private_key_path}")
        host        = self.default_ipv4_address
    }

    provisioner "file" {
        destination = "/tmp/bootstrap_k3s.sh"
        content = templatefile("bootstrap_k3s.sh.tpl",
            {
                k3s_token = var.k3s_token,
                k3s_cluster_join_ip = proxmox_vm_qemu.control-plane[0].default_ipv4_address
            }
        )
    }

    provisioner "remote-exec" {
        inline = [
            "set -e",
            "chmod +x /tmp/bootstrap_k3s.sh",
            "sudo /tmp/bootstrap_k3s.sh"
        ]
    }
}

resource "proxmox_vm_qemu" "worker" {
    # agent (worker) nodes
    count   = 2
    vmid    = "${count.index + 200}"
    name    = "worker-${count.index}"
    tags    = "worker"

    depends_on = [
      proxmox_vm_qemu.control-plane[0]
    ]

    target_node = var.proxmox_node

    clone = var.template_name

    agent    = 1
    os_type  = "cloud-init"
    cores    = 2
    sockets  = 1
    cpu      = "host"
    memory   = 2048
    scsihw   = "virtio-scsi-pci"
    bootdisk = "scsi0"

    disk {
        slot     = 0
        size     = "10G"
        type     = "scsi"
        storage  = "local-lvm"
        iothread = 1
    }

    network {
        model  = "virtio"
        bridge = "vmbr0"
    }

    lifecycle {
        ignore_changes = [
            network,
        ]
    }

    ipconfig0 = "ip=dhcp"

    nameserver = "${var.proxmox_dns}"

    sshkeys = file("${var.ssh_public_key_path}")

    connection {
        type        = "ssh"
        user        = "ubuntu"
        private_key = file("${var.ssh_private_key_path}")
        host        = self.default_ipv4_address
    }

    provisioner "file" {
        destination = "/tmp/bootstrap_k3s.sh"
        content = templatefile("bootstrap_k3s.sh.tpl",
            {
                k3s_token = var.k3s_token,
                k3s_cluster_join_ip = proxmox_vm_qemu.control-plane[0].default_ipv4_address
            }
        )
    }

    provisioner "remote-exec" {
        inline = [
            "set -e",
            "chmod +x /tmp/bootstrap_k3s.sh",
            "sudo /tmp/bootstrap_k3s.sh"
        ]
    }
}
```

</p>
</details> 

<details><summary>Terraform plan (doctored)</summary>
<p>

```sh
$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_vm_qemu.control-plane[0] will be created
  + resource "proxmox_vm_qemu" "control-plane" {
      + additional_wait           = 5
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = "scsi0"
      + clone                     = "ubuntu-2004-cloudinit-template"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp"
      + kvm                       = true
      + memory                    = 2048
      + name                      = "control-0"
      + nameserver                = "192.168.50.1"
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-ed25519 AAAASTUFF
        EOT
      + tablet                    = true
      + tags                      = "control"
      + target_node               = "gaianode01"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 100

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 1
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "10G"
          + slot               = 0
          + ssd                = 0
          + storage            = "local-lvm"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

  # proxmox_vm_qemu.control-plane[1] will be created
  + resource "proxmox_vm_qemu" "control-plane" {
      + additional_wait           = 5
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = "scsi0"
      + clone                     = "ubuntu-2004-cloudinit-template"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp"
      + kvm                       = true
      + memory                    = 2048
      + name                      = "control-1"
      + nameserver                = "192.168.50.1"
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-ed25519 AAAACSTUFF
        EOT
      + tablet                    = true
      + tags                      = "control"
      + target_node               = "gaianode01"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 101

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 1
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "10G"
          + slot               = 0
          + ssd                = 0
          + storage            = "local-lvm"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

  # proxmox_vm_qemu.control-plane[2] will be created
  + resource "proxmox_vm_qemu" "control-plane" {
      + additional_wait           = 5
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = "scsi0"
      + clone                     = "ubuntu-2004-cloudinit-template"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp"
      + kvm                       = true
      + memory                    = 2048
      + name                      = "control-2"
      + nameserver                = "192.168.50.1"
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-ed25519 AAAASTUFF
        EOT
      + tablet                    = true
      + tags                      = "control"
      + target_node               = "gaianode01"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 102

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 1
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "10G"
          + slot               = 0
          + ssd                = 0
          + storage            = "local-lvm"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

  # proxmox_vm_qemu.worker[0] will be created
  + resource "proxmox_vm_qemu" "worker" {
      + additional_wait           = 5
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = "scsi0"
      + clone                     = "ubuntu-2004-cloudinit-template"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp"
      + kvm                       = true
      + memory                    = 2048
      + name                      = "worker-0"
      + nameserver                = "192.168.50.1"
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-ed25519 AAAACSTUFF
        EOT
      + tablet                    = true
      + tags                      = "worker"
      + target_node               = "gaianode01"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 200

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 1
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "10G"
          + slot               = 0
          + ssd                = 0
          + storage            = "local-lvm"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

  # proxmox_vm_qemu.worker[1] will be created
  + resource "proxmox_vm_qemu" "worker" {
      + additional_wait           = 5
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = "scsi0"
      + clone                     = "ubuntu-2004-cloudinit-template"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp"
      + kvm                       = true
      + memory                    = 2048
      + name                      = "worker-1"
      + nameserver                = "192.168.50.1"
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-ed25519 AAAACSTUFF
        EOT
      + tablet                    = true
      + tags                      = "worker"
      + target_node               = "gaianode01"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 201

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 1
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "10G"
          + slot               = 0
          + ssd                = 0
          + storage            = "local-lvm"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + control-plane = {
      + control-0 = (known after apply)
      + control-1 = (known after apply)
      + control-2 = (known after apply)
    }
  + worker        = {
      + worker-0 = (known after apply)
      + worker-1 = (known after apply)
    }

───────────────────────────────────────────────────────────────────────────────────────────────────────── 

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly      
these actions if you run "terraform apply" now.
```

</p>
</details> 

<details><summary>Debug output head</summary>
<p>

```sh
[90mTue, 11 Apr 2023 22:12:13 -0500[0m [32mINF[0m [1mgithub.com/Telmate/terraform-provider-proxmox/proxmox/util.go:159[0m[36m >[0m Enabling the capture of log-library logs as ithe _capturelog flag was detected
[90mTue, 11 Apr 2023 22:12:13 -0500[0m [32mINF[0m [1mgithub.com/Telmate/terraform-provider-proxmox/proxmox/util.go:192[0m[36m >[0m Logging Started. Root Logger Set to level debug
[90mTue, 11 Apr 2023 22:12:13 -0500[0m [32mINF[0m [1mgithub.com/Telmate/terraform-provider-proxmox/proxmox/resource_vm_qemu.go:1463[0m[36m >[0m Reading configuration for vmid [36mloggerName=[0mresource_vm_read [36mvmid=[0m100
2023/04/11 22:12:13 >>>>>>>>>> REQUEST:
GET /api2/json/cluster/resources?type=vm HTTP/1.1
Host: 192.168.50.5:8006
User-Agent: Go-http-client/1.1
Accept: application/json
Authorization: PVEAPIToken=STUFF
Accept-Encoding: gzip

2023/04/11 22:12:13 <<<<<<<<<< RESULT:
HTTP/1.1 200 OK
Content-Length: 596
Cache-Control: max-age=0
Connection: Keep-Alive
Content-Type: application/json;charset=UTF-8
Date: Wed, 12 Apr 2023 03:12:17 GMT
Expires: Wed, 12 Apr 2023 03:12:17 GMT
Pragma: no-cache
Server: pve-api-daemon/3.0

{"data":[{"netout":598,"type":"qemu","maxdisk":10737418240,"diskread":168517916,"uptime":13,"mem":278327296,"id":"qemu/100","name":"control-0","status":"running","disk":0,"netin":29127,"vmid":100,"cpu":0.613803634928557,"diskwrite":2489856,"tags":"control","maxcpu":2,"template":0,"maxmem":2147483648,"node":"gaianode01"},{"node":"gaianode01","maxmem":2147483648,"template":1,"maxcpu":2,"diskwrite":0,"cpu":0,"netin":0,"vmid":9000,"disk":0,"name":"ubuntu-2004-cloudinit-template","status":"stopped","mem":0,"id":"qemu/9000","uptime":0,"maxdisk":2361393152,"diskread":0,"netout":0,"type":"qemu"}]}

2023/04/11 22:12:13 >>>>>>>>>> REQUEST:
GET /api2/json/nodes/gaianode01/qemu/100/config HTTP/1.1
Host: 192.168.50.5:8006
User-Agent: Go-http-client/1.1
Accept: application/json
Authorization: PVEAPIToken=STUFF
Accept-Encoding: gzip

2023/04/11 22:12:13 <<<<<<<<<< RESULT:
HTTP/1.1 200 OK
Content-Length: 830
Cache-Control: max-age=0
Connection: Keep-Alive
Content-Type: application/json;charset=UTF-8
Date: Wed, 12 Apr 2023 03:12:17 GMT
Expires: Wed, 12 Apr 2023 03:12:17 GMT
Pragma: no-cache
Server: pve-api-daemon/3.0

{"data":{"serial0":"socket","digest":"700ca6964e1b90f83491db679bd436d2cad187b3","bios":"seabios","sshkeys":"STUFF","onboot":0,"ide2":"local-lvm:vm-100-cloudinit,media=cdrom,size=4M","tablet":1,"cpu":"host","boot":"c","smbios1":"uuid=6fddd378-c978-480d-90bf-83bea93e513e","hotplug":"network,disk,usb","scsi0":"local-lvm:vm-100-disk-0,iothread=1,size=10G","tags":"control","memory":2048,"scsihw":"virtio-scsi-pci","name":"control-0","agent":"1","cores":2,"vmgenid":"aeead5be-e609-4530-89b7-145c6d5f8025","vga":"serial0","numa":0,"bootdisk":"scsi0","kvm":1,"net0":"virtio=52:63:7B:8C:51:18,bridge=vmbr0","nameserver":"192.168.50.1","sockets":1,"meta":"creation-qemu=7.2.0,ctime=1681124063","ipconfig0":"ip=dhcp"}}
2023/04/11 22:12:13 >>>>>>>>>> REQUEST:
GET /api2/json/nodes/gaianode01/storage/local-lvm/content HTTP/1.1
Host: 192.168.50.5:8006
User-Agent: Go-http-client/1.1
Accept: application/json
Authorization: PVEAPIToken=STUFF
Accept-Encoding: gzip

2023/04/11 22:12:13 <<<<<<<<<< RESULT:
HTTP/1.1 200 OK
Content-Length: 495
Cache-Control: max-age=0
Connection: Keep-Alive
Connection: Keep-Alive
Content-Type: application/json;charset=UTF-8
Date: Wed, 12 Apr 2023 03:12:17 GMT
Expires: Wed, 12 Apr 2023 03:12:17 GMT
Pragma: no-cache
Server: pve-api-daemon/3.0

{"data":[{"volid":"local-lvm:vm-100-cloudinit","ctime":"1681269091","size":4194304,"format":"raw","content":"images","vmid":100},{"volid":"local-lvm:vm-100-disk-0","size":10737418240,"ctime":"1681269091","content":"images","vmid":100,"format":"raw"},{"size":4194304,"ctime":"1681169099","vmid":9000,"content":"images","format":"raw","volid":"local-lvm:vm-9000-cloudinit"},{"ctime":"1681169091","size":2361393152,"format":"raw","content":"images","vmid":9000,"volid":"local-lvm:vm-9000-disk-0"}]}
2023/04/11 22:12:13 >>>>>>>>>> REQUEST:
GET /api2/json/nodes/gaianode01/storage/local-lvm/status HTTP/1.1
Host: 192.168.50.5:8006
User-Agent: Go-http-client/1.1
Accept: application/json
Authorization: PVEAPIToken=STUFF
Accept-Encoding: gzip

2023/04/11 22:12:14 <<<<<<<<<< RESULT:
HTTP/1.1 200 OK
Content-Length: 148
Cache-Control: max-age=0
Connection: Keep-Alive
Connection: Keep-Alive
Content-Type: application/json;charset=UTF-8
Date: Wed, 12 Apr 2023 03:12:17 GMT
Expires: Wed, 12 Apr 2023 03:12:17 GMT
Pragma: no-cache
Server: pve-api-daemon/3.0

{"data":{"type":"lvmthin","content":"images,rootdir","enabled":1,"used":4206699007,"avail":872188927489,"shared":0,"total":876395626496,"active":1}}
2023/04/11 22:12:14 >>>>>>>>>> REQUEST:
GET /api2/json/nodes/gaianode01/storage/local-lvm/content HTTP/1.1
Host: 192.168.50.5:8006
User-Agent: Go-http-client/1.1
Accept: application/json
Authorization: PVEAPIToken=STUFF
Accept-Encoding: gzip

2023/04/11 22:12:14 <<<<<<<<<< RESULT:
HTTP/1.1 200 OK
Content-Length: 495
Cache-Control: max-age=0
Connection: Keep-Alive
Connection: Keep-Alive
Content-Type: application/json;charset=UTF-8
Date: Wed, 12 Apr 2023 03:12:18 GMT
Expires: Wed, 12 Apr 2023 03:12:18 GMT
Pragma: no-cache
Server: pve-api-daemon/3.0

{"data":[{"format":"raw","content":"images","vmid":100,"ctime":"1681269091","size":4194304,"volid":"local-lvm:vm-100-cloudinit"},{"volid":"local-lvm:vm-100-disk-0","format":"raw","content":"images","vmid":100,"ctime":"1681269091","size":10737418240},{"format":"raw","vmid":9000,"content":"images","ctime":"1681169099","size":4194304,"volid":"local-lvm:vm-9000-cloudinit"},{"volid":"local-lvm:vm-9000-disk-0","content":"images","vmid":9000,"format":"raw","size":2361393152,"ctime":"1681169091"}]}
2023/04/11 22:12:14 >>>>>>>>>> REQUEST:
GET /api2/json/nodes/gaianode01/storage/local-lvm/status HTTP/1.1
Host: 192.168.50.5:8006
User-Agent: Go-http-client/1.1
Accept: application/json
Authorization: PVEAPIToken=STUFF
Accept-Encoding: gzip
```

</p>
</details> 

<details><summary>Image of Proxmox Logs</summary>
<p>

![image](https://user-images.githubusercontent.com/23508156/232224609-5693063c-74f3-4a80-bd33-0de0d532e64e.png)


</p>
</details> 